#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=531916ae-9232-4827-81d9-c27e62d77dbe]
module.keycloak_prod.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3b11074c-69a4-42d8-b319-82a5345a3788]
module.keycloak_prod.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c730e9b7-3c0b-4aa6-9c3a-fc689e8aebe5]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3a4ac4e7-da90-4042-aef9-10677d990afb]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=291fedbf-ec46-45de-8332-11835e708442]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c4dfcedb-db24-487f-8a5d-8518174e4740]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e5d4599c-95e0-40ec-8a42-61ec36d3a7ea]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=eecc57dd-b85f-44c1-832e-5391b4fb8c5c]
module.keycloak_prod.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=52e52c1c-f09d-4bb4-925f-d2ee657ee25c]
module.keycloak_prod.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f73f6560-4898-47cb-9902-9962e55f2d22]
module.keycloak_prod.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=264ef17b-f3b4-42b3-8f09-60dce3f52dcd]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2cac6a93-6012-49f2-ae8e-40b8fc62978a]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e5949b15-432f-4a8f-bf6d-2d46c1369413]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=934a6132-335a-4abb-b21b-8ba8e7a171e7]
module.keycloak_prod.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=559d98a0-b6c6-4b57-8da7-cfc3742aac1b]
module.keycloak_prod.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=226b562f-413e-4119-9156-87ca1fa23c21]
module.keycloak_prod.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=99537a6f-9ae2-49e3-b703-f270520003a8]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2491e226-7bee-491e-8fb9-f431a07a762e]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3c98e029-5dc2-4536-8a1d-49a15749771e]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e05a4562-037d-485d-9330-ccafb395ccd4]
module.keycloak_prod.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=53bae059-b484-4a36-b024-f0e7dd302631]
module.keycloak_prod.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e1e24806-e4e8-4fce-b335-5f980d844675]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8b809df1-d101-4ec5-a51a-d6a7d316f1a3]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d74df522-b36e-4221-8e7c-c63e6f46671c]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_openid_client.this: Refreshing state... [id=d9ea1689-ab66-4bdd-82d6-19e31007b2b5]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d9de921f-2054-4a1b-b31a-d856e30904cf]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0791fab7-a968-4a2e-beb6-3e26a7076af4]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=48836d07-ea8c-4e3e-8d54-32040f204ba4]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3e160578-b8f2-4d3a-8532-ca1893c9ac3c]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=12cdc048-9154-496a-8771-6ce4b4da69a3]
module.keycloak_prod.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3c388c82-b7dd-41c0-bd77-f62378d94fa4]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f4e10d15-e04e-4027-a75e-ce0212eab4a0]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=76d8c310-d0e6-4911-aea1-27d16cc282fe]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a9603c3a-f974-4167-a255-ee39e6272f66]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3972f8ee-e4f4-4415-a6eb-324ffbbaa3b7]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4e7899c0-1fe9-48c7-ab88-7421b9407c68]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3f89b042-ccf7-40b8-8cd5-c6a362474135]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5835e677-1f31-41f4-93a0-1030f961940a]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=552ed6bd-c554-4334-84c7-0a48d438c7dd]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2aba48ea-ad83-437f-9a32-115347ffc4fa]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9cc9674a-c23f-4d45-9d86-6d34cb7c767e]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fdea4659-f81b-4412-8790-d2a34fed0870]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d354c9f1-450b-44a5-ba23-83285dbe27b2]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6c19e3da-fbc5-4036-b152-0c25654d4907]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2b146397-e5e7-4fd3-b4bb-e429bcdd71b7]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7e37c2e2-3f69-4d96-b762-3e2495f6a27b]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=345c4bbf-7092-4190-a322-26d18b831c16]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e2ff7649-8a81-47b9-a6f2-c4f6c5f15f83]
module.keycloak_prod.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fa382880-a7c6-4f8d-ace8-62a6fa0af41b]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=edd3c802-b50b-4ae1-b13a-09efc1ad38dc]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=73ee4f1d-3217-4e32-87f5-e5dda27ce9b3]
module.keycloak_prod.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a6ca6752-05da-45eb-aff5-0e2c1a3d6437]
module.keycloak_prod.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c6a20c6e-de11-409a-9070-b71d9a3bef96]
module.keycloak_prod.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=619c7e73-594d-4e09-97da-bea8d65ec851]
module.keycloak_prod.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4144e2d5-de81-40bb-b22f-b4465cfed586]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-239.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=29cfd2d3-5191-4f18-b310-31ba3d1a1415]
module.keycloak_prod.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0c620cb4-d71d-4493-8bd9-f56955df890a]
module.keycloak_prod.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=505aff7f-a1e7-4c38-8a93-ba05c8461091]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=fbe6482e-4bcc-4c32-88df-4933245390df]
module.keycloak_prod.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5e6e4350-96c0-4ea4-b3d5-4593465d90aa]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=86686d11-07cc-4798-8d98-25223832e91b]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=427186bb-b6f7-48e8-ba04-6a46b120a7d6]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8e75d623-22ed-4b1d-8396-cc5f0760b923]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=ae948df4-2932-4bb8-83a5-fc9f84e47e9f]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=08454973-aece-41fd-bd2b-4eeaa42191a7]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f85d2179-5d76-4bf2-b8a2-03765cc19d75]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0b44cd2f-d198-4809-9b78-549ad057b924]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c9d0930c-f6ce-47f8-9a40-1d45f77b9c89]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c182d801-b9a7-4bc6-8e62-25d630dd46bd]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1a505970-a611-4d05-af78-26ed0f0c0082]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=415a4e26-9b3f-4b3f-b6b8-68b60c301ce0]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a249f5c8-339a-4e79-891a-9cabff5710a6]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f70b3b01-c291-4174-ba58-3144211642e1]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7e935485-4cf1-460f-b611-fa0147701fe9]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f19962a8-7572-4ce9-ad28-0a3643588c53]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c54fccea-5aaf-4fcd-a102-cdcb42edbd10]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=99f9c885-065a-4ff4-94f5-db959a8a20eb]
module.keycloak_prod.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4fd557dc-4276-4682-b194-58276f28bb8b]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7664b246-131a-4659-afb6-dd33d238f10b]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f8a805fc-2b9b-403a-be71-8c398e41403b]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f01faa6a-3ed7-4ba9-997b-f0e700b4f298]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3a1046b2-f84f-478d-8660-daf21b43de9c]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=04c24d57-2ce2-4f79-8d82-44eaed51cde6]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1063a59d-6c8c-4926-b66b-092fa4a9d848]
module.keycloak_prod.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4cfcb46c-52ec-4cb3-9a89-16859fbd86bb]
module.keycloak_prod.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=88d99630-4e70-4821-a666-035df1f17393]
module.keycloak_prod.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2ce7bbdf-ee35-4f6f-88cc-31ced229c071]
module.keycloak_prod.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=cdc47e59-91be-4b5f-a3be-d4b49fccb640]
module.keycloak_prod.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9bc60b97-70c0-46bc-ab95-5fb02246b944]
module.keycloak_prod.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0fc2d4e4-bb00-4145-91c5-8f318d4fb74f]
module.keycloak_prod.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c8c1d621-1da6-4059-93f3-bfc68c072bdf]
module.keycloak_prod.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ffa21011-0f4b-4c01-a56c-dbfde48517a0]
module.keycloak_prod.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=0e5d5dd5-0f42-4f2f-96da-722ffbb276df]
module.keycloak_prod.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2203e377-d967-4f62-9ff8-1d15b35f2894]
module.keycloak_prod.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c450ee6b-ce68-4198-9795-f62908af3347]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=9cdea73c-48fe-4686-b513-333e7f52d6ed]
module.keycloak_prod.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=fdbf9427-b5d6-4631-a27a-17a1127f4f03]
module.keycloak_prod.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=455685c6-6ade-4f63-878f-f0ad819a2928]
module.keycloak_prod.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=9fd35c80-43a3-4fd8-8efd-37543535060e]
module.keycloak_prod.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=56615aeb-96ed-43d3-9c53-11dccf806b55]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "tians-testing-multiple-members-no-prod-5086"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "tians-testing-multiple-members-no-prod-5086"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "tians-testing-multiple-members-no-prod-5086"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "tians-testing-multiple-members-no-prod-5086"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://example",
        ]
      + web_origins                              = [
          + "+",
          + "https://example",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "tians-testing-multiple-members-no-prod-5086"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "tians-testing-multiple-members-no-prod-5086"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-no-prod-5086.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "tians-testing-multiple-members-no-prod-5086"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "tians-testing-multiple-members-no-prod-5086"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://example",
        ]
      + web_origins                              = [
          + "+",
          + "https://example",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3492 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*